#取3位小數 {:.3f}
#顯示正負號{:+.3f}
#對齊 靠左<  靠右>  置中^  {:>+.3f}
#對齊字元的位移{:+>10.3f}
#比較有逗號無逗號的對齊

num1 = 1.66
num2 = -80
num3 = 12.8

#有逗號
print(f'價格1 為 {num1:>+10.3f}\n',
      f'價格2 為 {num2:>+10.3f}\n',
      f'價格3 為 {num3:>+10.3f}')

print('-' * 30)

#無逗號
print(f'價格1 為 {num1:>+10.3f}\n'
      f'價格2 為 {num2:>+10.3f}\n'
      f'價格3 為 {num3:>+10.3f}')
print('-' * 30)
#絕對值
print(f'價格1 為 {abs(num1):>+10.3f}\n'
      f'價格2 為 {abs(num2):>+10.3f}\n'
      f'價格3 為 {abs(num3):>+10.3f}')